paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/lookupRefund.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.lookuprefund">
  <soapenv:Header/>
   <soapenv:Body>
     <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
   	<urn:id>9F564596BA063112J</urn:id>
   	<urn:authorization>Bearer 7RDA.3yMKBJrpm.wu-3FPuJ1r7mXqfe6mcIehN64CWE</urn:authorization>
   </soapenv:Body>
</soapenv:Envelope>
